
Table PERSONS이(가) 생성되었습니다.


명령의 74 행에서 시작하는 중 오류 발생 -
CREATE TABLE persons2 AS SELECT *, age varchar(20), gender varchar(50), address varchar(50) FROM persons
오류 보고 -
ORA-00923: FROM keyword not found where expected
00923. 00000 -  "FROM keyword not found where expected"
*Cause:    
*Action:

명령의 74 행에서 시작하는 중 오류 발생 -
CREATE TABLE persons2 AS
SELECT *, 
       CAST(NULL AS VARCHAR(20)) AS age, 
       CAST(NULL AS VARCHAR(50)) AS gender, 
       CAST(NULL AS VARCHAR(50)) AS address 
FROM persons
오류 보고 -
ORA-00923: FROM keyword not found where expected
00923. 00000 -  "FROM keyword not found where expected"
*Cause:    
*Action:

명령의 74 행에서 시작하는 중 오류 발생 -
CREATE TABLE persons2 AS
SELECT p.*, 
       CAST(NULL AS VARCHAR(20)) AS age, 
       CAST(NULL AS VARCHAR(50)) AS gender, 
       CAST(NULL AS VARCHAR(50)) AS address 
FROM persons p
오류 보고 -
ORA-00957: duplicate column name
00957. 00000 -  "duplicate column name"
*Cause:    
*Action:

Table PLAYS이(가) 생성되었습니다.


명령의 98 행에서 시작하는 중 오류 발생 -
CREATE TABLE PERSONS(
ID VARCHAR2(4) PRIMARY KEY,
NAME VARCHAR2(20) NOT NULL UNIQUE,
AGE NUMBER(3) CHECK(AGE>=18),
TELNUM VARCHAR2(20),
ADDR VARCHAR2(100) DEFAULT 'SEOUL',
BDAY DATE DEFAULT SYSDATE
)
오류 보고 -
ORA-00955: name is already used by an existing object
00955. 00000 -  "name is already used by an existing object"
*Cause:    
*Action:

1 행 이(가) 삽입되었습니다.


명령의 108 행에서 시작하는 중 오류 발생 -
INSERT INTO PERSONS(NAME,AGE,TELNUM)
VALUES('SCOTT',20,'010123445567')
오류 보고 -
ORA-01400: cannot insert NULL into ("SCOTT"."PERSONS"."ID")


Table PERSONS2이(가) 생성되었습니다.


Table EMP_DDL이(가) 삭제되었습니다.


Table EMP_DDL이(가) 생성되었습니다.

이름       널? 유형           
-------- -- ------------ 
EMPNO       NUMBER(4)    
ENAME       VARCHAR2(10) 
JOB         VARCHAR2(9)  
MGR         NUMBER(4)    
HIREDATE    DATE         
SAL         NUMBER(7,2)  
COM         NUMBER(7,2)  
DEPTNO      NUMBER(2)    

Table DEPT_DDL이(가) 삭제되었습니다.


Table DEPT_DDL이(가) 생성되었습니다.

이름     널? 유형           
------ -- ------------ 
DEPTNO    NUMBER(2)    
DNAME     VARCHAR2(14) 
LOC       VARCHAR2(13) 

명령의 22 행에서 시작하는 중 오류 발생 -
CREATE TABLE SALGRADE_DDL
AS SELECT * FROM SALGRADE
오류 보고 -
ORA-00955: name is already used by an existing object
00955. 00000 -  "name is already used by an existing object"
*Cause:    
*Action:
이름    널? 유형           
----- -- ------------ 
GRADE    NUMBER       
LOSAL    NUMBER       
HISAL    NUMBER       
HOME     VARCHAR2(20) 

Table SALGRADE_DDL이(가) 변경되었습니다.


명령의 35 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
RENAME COLUMN PARTY TO HOME
오류 보고 -
ORA-00957: duplicate column name
00957. 00000 -  "duplicate column name"
*Cause:    
*Action:

명령의 38 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGARDE_DDL
MODIFY HOME NUMBER(10)
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:
이름    널? 유형           
----- -- ------------ 
GRADE    NUMBER       
LOSAL    NUMBER       
HISAL    NUMBER       
HOME     VARCHAR2(20) 
PARTY    VARCHAR2(20) 

Table SALGRADE_DDL이(가) 변경되었습니다.


테이블 이름이 변경되었습니다.

이름    널? 유형           
----- -- ------------ 
GRADE    NUMBER       
LOSAL    NUMBER       
HISAL    NUMBER       
PARTY    VARCHAR2(20) 

     GRADE      LOSAL      HISAL PARTY               
---------- ---------- ---------- --------------------
         1        700       1200                     
         2       1201       1400                     
         3       1401       2000                     
         4       2001       3000                     
         5       3001       9999                     


Table SALZIP이(가) 잘렸습니다.


Table SALZIP이(가) 삭제되었습니다.


Comment이(가) 생성되었습니다.


명령의 57 행에서 시작하는 중 오류 발생 -
COMMENT ON COLUMN DEPF_DDL.LOC IS '부서위치'
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT                           TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

EMP                            TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

BONUS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
SALGRADE                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PERSONS                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PLAYS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
PERSONS2                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

EMP_DDL                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       TABLE       
DDL연습테이블                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           


9개 행이 선택되었습니다. 


TABLE_NAME                     COLUMN_NAME
------------------------------ ------------------------------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       DEPTNO                         
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       DNAME                          
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       LOC                            
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        



명령의 62 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
ADD PARTY VARCHAR2(20)
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 65 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
RENAME COLUMN PARTY TO HOME
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 68 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGARDE_DDL
MODIFY HOME NUMBER(10)
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

오류:
ORA-04043: SALGRADE_DDL 객체가 존재하지 않습니다.

명령의 72 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
DROP COLUMN HOME
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 75 행에서 시작하는 중 오류 발생 -
RENAME SALGRADE_DDL TO SALZIP
오류 보고 -
ORA-04043: object SALGRADE_DDL does not exist
04043. 00000 -  "object %s does not exist"
*Cause:    An object name was specified that was not recognized by the system.
           There are several possible causes:
           - An invalid name for a table, view, sequence, procedure, function,
           package, or package body was entered. Since the system could not
           recognize the invalid name, it responded with the message that the
           named object does not exist.
           - An attempt was made to rename an index or a cluster, or some
           other object that cannot be renamed.
*Action:   Check the spelling of the named object and rerun the code. (Valid
           names of tables, views, functions, etc. can be listed by querying
           the data dictionary.)

오류:
ORA-04043: SALZIP 객체가 존재하지 않습니다.

명령의 78 행에서 시작하는 중 오류 발생 -
SELECT * FROM SALZIP
오류 발생 명령행: 78 열: 15
오류 보고 -
SQL 오류: ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 80 행에서 시작하는 중 오류 발생 -
TRUNCATE TABLE SALZIP
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 81 행에서 시작하는 중 오류 발생 -
DROP TABLE SALZIP
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

Comment이(가) 생성되었습니다.


명령의 87 행에서 시작하는 중 오류 발생 -
COMMENT ON COLUMN DEPF_DDL.LOC IS '부서위치'
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       TABLE       
DDL연습테이블                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           

EMP_DDL                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PERSONS2                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
PLAYS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PERSONS                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

SALGRADE                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
BONUS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

EMP                            TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT                           TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


9개 행이 선택되었습니다. 


TABLE_NAME                     COLUMN_NAME
------------------------------ ------------------------------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       DEPTNO                         
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       DNAME                          
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       LOC                            
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        



명령의 95 행에서 시작하는 중 오류 발생 -
DROP TABLE PERSONS
오류 보고 -
ORA-02449: unique/primary keys in table referenced by foreign keys
02449. 00000 -  "unique/primary keys in table referenced by foreign keys"
*Cause:    An attempt was made to drop a table with unique or
           primary keys referenced by foreign keys in another table.
*Action:   Before performing the above operations the table, drop the
           foreign key constraints in other tables. You can see what
           constraints are referencing a table by issuing the following
           command:
           SELECT * FROM USER_CONSTRAINTS WHERE TABLE_NAME = "tabnam";

Table PERSONS2이(가) 삭제되었습니다.


명령의 98 행에서 시작하는 중 오류 발생 -
CREATE TABLE PERSONS(
ID VARCHAR2(4) PRIMARY KEY,
NAME VARCHAR2(20) NOT NULL UNIQUE,
AGE NUMBER(3) CHECK(AGE>=18),
TELNUM VARCHAR2(20),
ADDR VARCHAR2(100) DEFAULT 'SEOUL',
BDAY DATE DEFAULT SYSDATE
)
오류 보고 -
ORA-00955: name is already used by an existing object
00955. 00000 -  "name is already used by an existing object"
*Cause:    
*Action:

명령의 106 행에서 시작하는 중 오류 발생 -
INSERT INTO PERSONS(ID,NAME,AGE,TELNUM)
VALUES('1000','SCOTT',20,'01012345567')
오류 보고 -
ORA-00001: unique constraint (SCOTT.SYS_C007093) violated


명령의 108 행에서 시작하는 중 오류 발생 -
INSERT INTO PERSONS(NAME,AGE,TELNUM)
VALUES('SCOTT',20,'010123445567')
오류 보고 -
ORA-01400: cannot insert NULL into ("SCOTT"."PERSONS"."ID")


Table PERSONS2이(가) 생성되었습니다.


Table PERSONS2이(가) 변경되었습니다.


Table PERSONS2이(가) 변경되었습니다.


Table PERSONS2이(가) 변경되었습니다.


명령의 132 행에서 시작하는 중 오류 발생 -
CREATE TABLE plays(
    play_id number(10) primary key,
    play_result varchar2(100),
    persons_id varchar2(4), constraint fk_plays FOREIGN KEY(persons_id)
    REFERENCES persons(id)
        ON DELETE CASCADE
)
오류 보고 -
ORA-00955: name is already used by an existing object
00955. 00000 -  "name is already used by an existing object"
*Cause:    
*Action:

Table EMP_DDL이(가) 삭제되었습니다.


Table EMP_DDL이(가) 생성되었습니다.

이름       널? 유형           
-------- -- ------------ 
EMPNO       NUMBER(4)    
ENAME       VARCHAR2(10) 
JOB         VARCHAR2(9)  
MGR         NUMBER(4)    
HIREDATE    DATE         
SAL         NUMBER(7,2)  
COM         NUMBER(7,2)  
DEPTNO      NUMBER(2)    

Table DEPT_DDL이(가) 삭제되었습니다.


Table DEPT_DDL이(가) 생성되었습니다.

이름     널? 유형           
------ -- ------------ 
DEPTNO    NUMBER(2)    
DNAME     VARCHAR2(14) 
LOC       VARCHAR2(13) 

Table SALGRADE_DDL이(가) 생성되었습니다.

이름    널? 유형     
----- -- ------ 
GRADE    NUMBER 
LOSAL    NUMBER 
HISAL    NUMBER 

Table SALGRADE_DDL이(가) 변경되었습니다.


Table SALGRADE_DDL이(가) 변경되었습니다.


명령의 38 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGARDE_DDL
MODIFY HOME NUMBER(10)
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:
이름    널? 유형           
----- -- ------------ 
GRADE    NUMBER       
LOSAL    NUMBER       
HISAL    NUMBER       
HOME     VARCHAR2(20) 

Table SALGRADE_DDL이(가) 변경되었습니다.


테이블 이름이 변경되었습니다.

이름    널? 유형     
----- -- ------ 
GRADE    NUMBER 
LOSAL    NUMBER 
HISAL    NUMBER 

     GRADE      LOSAL      HISAL
---------- ---------- ----------
         1        700       1200
         2       1201       1400
         3       1401       2000
         4       2001       3000
         5       3001       9999


Table SALZIP이(가) 잘렸습니다.


Table SALZIP이(가) 삭제되었습니다.


Comment이(가) 생성되었습니다.


명령의 57 행에서 시작하는 중 오류 발생 -
COMMENT ON COLUMN DEPF_DDL.LOC IS '부서위치'
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       TABLE       
DDL연습테이블                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           

EMP_DDL                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PERSONS2                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
PLAYS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PERSONS                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

SALGRADE                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
BONUS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

EMP                            TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT                           TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


9개 행이 선택되었습니다. 


TABLE_NAME                     COLUMN_NAME
------------------------------ ------------------------------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       DEPTNO                         
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       DNAME                          
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       LOC                            
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        



명령의 62 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
ADD PARTY VARCHAR2(20)
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 65 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
RENAME COLUMN PARTY TO HOME
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 68 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGARDE_DDL
MODIFY HOME NUMBER(10)
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

오류:
ORA-04043: SALGRADE_DDL 객체가 존재하지 않습니다.

명령의 72 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
DROP COLUMN HOME
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 75 행에서 시작하는 중 오류 발생 -
RENAME SALGRADE_DDL TO SALZIP
오류 보고 -
ORA-04043: object SALGRADE_DDL does not exist
04043. 00000 -  "object %s does not exist"
*Cause:    An object name was specified that was not recognized by the system.
           There are several possible causes:
           - An invalid name for a table, view, sequence, procedure, function,
           package, or package body was entered. Since the system could not
           recognize the invalid name, it responded with the message that the
           named object does not exist.
           - An attempt was made to rename an index or a cluster, or some
           other object that cannot be renamed.
*Action:   Check the spelling of the named object and rerun the code. (Valid
           names of tables, views, functions, etc. can be listed by querying
           the data dictionary.)

오류:
ORA-04043: SALZIP 객체가 존재하지 않습니다.

명령의 78 행에서 시작하는 중 오류 발생 -
SELECT * FROM SALZIP
오류 발생 명령행: 78 열: 15
오류 보고 -
SQL 오류: ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 80 행에서 시작하는 중 오류 발생 -
TRUNCATE TABLE SALZIP
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 81 행에서 시작하는 중 오류 발생 -
DROP TABLE SALZIP
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

Comment이(가) 생성되었습니다.


명령의 87 행에서 시작하는 중 오류 발생 -
COMMENT ON COLUMN DEPF_DDL.LOC IS '부서위치'
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       TABLE       
DDL연습테이블                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           

EMP_DDL                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PERSONS2                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
PLAYS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PERSONS                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

SALGRADE                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
BONUS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

EMP                            TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT                           TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


9개 행이 선택되었습니다. 


TABLE_NAME                     COLUMN_NAME
------------------------------ ------------------------------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       DEPTNO                         
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       DNAME                          
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       LOC                            
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        



명령의 95 행에서 시작하는 중 오류 발생 -
DROP TABLE PERSONS
오류 보고 -
ORA-02449: unique/primary keys in table referenced by foreign keys
02449. 00000 -  "unique/primary keys in table referenced by foreign keys"
*Cause:    An attempt was made to drop a table with unique or
           primary keys referenced by foreign keys in another table.
*Action:   Before performing the above operations the table, drop the
           foreign key constraints in other tables. You can see what
           constraints are referencing a table by issuing the following
           command:
           SELECT * FROM USER_CONSTRAINTS WHERE TABLE_NAME = "tabnam";

Table PERSONS2이(가) 삭제되었습니다.


명령의 98 행에서 시작하는 중 오류 발생 -
CREATE TABLE PERSONS(
ID VARCHAR2(4) PRIMARY KEY,
NAME VARCHAR2(20) NOT NULL UNIQUE,
AGE NUMBER(3) CHECK(AGE>=18),
TELNUM VARCHAR2(20),
ADDR VARCHAR2(100) DEFAULT 'SEOUL',
BDAY DATE DEFAULT SYSDATE
)
오류 보고 -
ORA-00955: name is already used by an existing object
00955. 00000 -  "name is already used by an existing object"
*Cause:    
*Action:

명령의 106 행에서 시작하는 중 오류 발생 -
INSERT INTO PERSONS(ID,NAME,AGE,TELNUM)
VALUES('1000','SCOTT',20,'01012345567')
오류 보고 -
ORA-00001: unique constraint (SCOTT.SYS_C007093) violated


명령의 108 행에서 시작하는 중 오류 발생 -
INSERT INTO PERSONS(NAME,AGE,TELNUM)
VALUES('SCOTT',20,'010123445567')
오류 보고 -
ORA-01400: cannot insert NULL into ("SCOTT"."PERSONS"."ID")


Table PERSONS2이(가) 생성되었습니다.


Table PERSONS2이(가) 변경되었습니다.


Table PERSONS2이(가) 변경되었습니다.


Table PERSONS2이(가) 변경되었습니다.


명령의 132 행에서 시작하는 중 오류 발생 -
CREATE TABLE plays(
    play_id number(10) primary key,
    play_result varchar2(100),
    persons_id varchar2(4), constraint fk_plays FOREIGN KEY(persons_id)
    REFERENCES persons(id)
        ON DELETE CASCADE
)
오류 보고 -
ORA-00955: name is already used by an existing object
00955. 00000 -  "name is already used by an existing object"
*Cause:    
*Action:

Table PERSONS2이(가) 변경되었습니다.


명령의 125 행에서 시작하는 중 오류 발생 -
ALTER TABLE PERSONS2
DROP CONSTRAINT CHK_PERSON2
오류 보고 -
ORA-02443: Cannot drop constraint  - nonexistent constraint
02443. 00000 -  "Cannot drop constraint  - nonexistent constraint"
*Cause:    alter table drop constraint <constraint_name>
*Action:   make sure you supply correct constraint name.

명령의 128 행에서 시작하는 중 오류 발생 -
ALTER TABLE PERSONS2
ADD CONSTRAINT CHK_P2 CHECK(AGE>50)
오류 보고 -
ORA-02264: name already used by an existing constraint
02264. 00000 -  "name already used by an existing constraint"
*Cause:    The specified constraint name has to be unique.
*Action:   Specify a unique constraint name for the constraint.

명령의 132 행에서 시작하는 중 오류 발생 -
CREATE TABLE plays(
    play_id number(10) primary key,
    play_result varchar2(100),
    persons_id varchar2(4), constraint fk_plays FOREIGN KEY(persons_id)
    REFERENCES persons(id)
        ON DELETE CASCADE
)
오류 보고 -
ORA-00955: name is already used by an existing object
00955. 00000 -  "name is already used by an existing object"
*Cause:    
*Action:

Table PERSONS2이(가) 변경되었습니다.


명령의 125 행에서 시작하는 중 오류 발생 -
ALTER TABLE PERSONS2
DROP CONSTRAINT CHK_PERSON2
오류 보고 -
ORA-02443: Cannot drop constraint  - nonexistent constraint
02443. 00000 -  "Cannot drop constraint  - nonexistent constraint"
*Cause:    alter table drop constraint <constraint_name>
*Action:   make sure you supply correct constraint name.

명령의 125 행에서 시작하는 중 오류 발생 -
ALTER TABLE PERSONS2
DROP CONSTRAINT CHK_PERSON2
오류 보고 -
ORA-02443: Cannot drop constraint  - nonexistent constraint
02443. 00000 -  "Cannot drop constraint  - nonexistent constraint"
*Cause:    alter table drop constraint <constraint_name>
*Action:   make sure you supply correct constraint name.

명령의 128 행에서 시작하는 중 오류 발생 -
ALTER TABLE PERSONS2
ADD CONSTRAINT CHK_P2 CHECK(AGE>50)
오류 보고 -
ORA-02264: name already used by an existing constraint
02264. 00000 -  "name already used by an existing constraint"
*Cause:    The specified constraint name has to be unique.
*Action:   Specify a unique constraint name for the constraint.

Table PKTABLE이(가) 생성되었습니다.


Table FKTABLE이(가) 생성되었습니다.


Table EMP_DDL이(가) 삭제되었습니다.


Table EMP_DDL이(가) 생성되었습니다.

이름       널? 유형           
-------- -- ------------ 
EMPNO       NUMBER(4)    
ENAME       VARCHAR2(10) 
JOB         VARCHAR2(9)  
MGR         NUMBER(4)    
HIREDATE    DATE         
SAL         NUMBER(7,2)  
COM         NUMBER(7,2)  
DEPTNO      NUMBER(2)    

Table DEPT_DDL이(가) 삭제되었습니다.


Table DEPT_DDL이(가) 생성되었습니다.

이름     널? 유형           
------ -- ------------ 
DEPTNO    NUMBER(2)    
DNAME     VARCHAR2(14) 
LOC       VARCHAR2(13) 

Table SALGRADE_DDL이(가) 생성되었습니다.

이름    널? 유형     
----- -- ------ 
GRADE    NUMBER 
LOSAL    NUMBER 
HISAL    NUMBER 

Table SALGRADE_DDL이(가) 변경되었습니다.


Table SALGRADE_DDL이(가) 변경되었습니다.


명령의 38 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGARDE_DDL
MODIFY HOME NUMBER(10)
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:
이름    널? 유형           
----- -- ------------ 
GRADE    NUMBER       
LOSAL    NUMBER       
HISAL    NUMBER       
HOME     VARCHAR2(20) 

Table SALGRADE_DDL이(가) 변경되었습니다.


테이블 이름이 변경되었습니다.

이름    널? 유형     
----- -- ------ 
GRADE    NUMBER 
LOSAL    NUMBER 
HISAL    NUMBER 

     GRADE      LOSAL      HISAL
---------- ---------- ----------
         1        700       1200
         2       1201       1400
         3       1401       2000
         4       2001       3000
         5       3001       9999


Table SALZIP이(가) 잘렸습니다.


Table SALZIP이(가) 삭제되었습니다.


Comment이(가) 생성되었습니다.


명령의 57 행에서 시작하는 중 오류 발생 -
COMMENT ON COLUMN DEPF_DDL.LOC IS '부서위치'
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       TABLE       
DDL연습테이블                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           

EMP_DDL                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

FKTABLE                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
PERSONS2                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PKTABLE                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PLAYS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
PERSONS                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

SALGRADE                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

BONUS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
EMP                            TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT                           TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


11개 행이 선택되었습니다. 


TABLE_NAME                     COLUMN_NAME
------------------------------ ------------------------------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       DEPTNO                         
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       DNAME                          
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       LOC                            
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        



명령의 62 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
ADD PARTY VARCHAR2(20)
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 65 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
RENAME COLUMN PARTY TO HOME
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 68 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGARDE_DDL
MODIFY HOME NUMBER(10)
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

오류:
ORA-04043: SALGRADE_DDL 객체가 존재하지 않습니다.

명령의 72 행에서 시작하는 중 오류 발생 -
ALTER TABLE SALGRADE_DDL
DROP COLUMN HOME
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 75 행에서 시작하는 중 오류 발생 -
RENAME SALGRADE_DDL TO SALZIP
오류 보고 -
ORA-04043: object SALGRADE_DDL does not exist
04043. 00000 -  "object %s does not exist"
*Cause:    An object name was specified that was not recognized by the system.
           There are several possible causes:
           - An invalid name for a table, view, sequence, procedure, function,
           package, or package body was entered. Since the system could not
           recognize the invalid name, it responded with the message that the
           named object does not exist.
           - An attempt was made to rename an index or a cluster, or some
           other object that cannot be renamed.
*Action:   Check the spelling of the named object and rerun the code. (Valid
           names of tables, views, functions, etc. can be listed by querying
           the data dictionary.)

오류:
ORA-04043: SALZIP 객체가 존재하지 않습니다.

명령의 78 행에서 시작하는 중 오류 발생 -
SELECT * FROM SALZIP
오류 발생 명령행: 78 열: 15
오류 보고 -
SQL 오류: ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 80 행에서 시작하는 중 오류 발생 -
TRUNCATE TABLE SALZIP
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

명령의 81 행에서 시작하는 중 오류 발생 -
DROP TABLE SALZIP
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

Comment이(가) 생성되었습니다.


명령의 87 행에서 시작하는 중 오류 발생 -
COMMENT ON COLUMN DEPF_DDL.LOC IS '부서위치'
오류 보고 -
ORA-00942: table or view does not exist
00942. 00000 -  "table or view does not exist"
*Cause:    
*Action:

TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       TABLE       
DDL연습테이블                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           

EMP_DDL                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

FKTABLE                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
PERSONS2                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PKTABLE                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

PLAYS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
PERSONS                        TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

SALGRADE                       TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

BONUS                          TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


TABLE_NAME                     TABLE_TYPE
------------------------------ -----------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
EMP                            TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT                           TABLE       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        


11개 행이 선택되었습니다. 


TABLE_NAME                     COLUMN_NAME
------------------------------ ------------------------------
COMMENTS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
DEPT_DDL                       DEPTNO                         
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       DNAME                          
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        

DEPT_DDL                       LOC                            
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        



명령의 95 행에서 시작하는 중 오류 발생 -
DROP TABLE PERSONS
오류 보고 -
ORA-02449: unique/primary keys in table referenced by foreign keys
02449. 00000 -  "unique/primary keys in table referenced by foreign keys"
*Cause:    An attempt was made to drop a table with unique or
           primary keys referenced by foreign keys in another table.
*Action:   Before performing the above operations the table, drop the
           foreign key constraints in other tables. You can see what
           constraints are referencing a table by issuing the following
           command:
           SELECT * FROM USER_CONSTRAINTS WHERE TABLE_NAME = "tabnam";

Table PERSONS2이(가) 삭제되었습니다.


명령의 98 행에서 시작하는 중 오류 발생 -
CREATE TABLE PERSONS(
ID VARCHAR2(4) PRIMARY KEY,
NAME VARCHAR2(20) NOT NULL UNIQUE,
AGE NUMBER(3) CHECK(AGE>=18),
TELNUM VARCHAR2(20),
ADDR VARCHAR2(100) DEFAULT 'SEOUL',
BDAY DATE DEFAULT SYSDATE
)
오류 보고 -
ORA-00955: name is already used by an existing object
00955. 00000 -  "name is already used by an existing object"
*Cause:    
*Action:

명령의 106 행에서 시작하는 중 오류 발생 -
INSERT INTO PERSONS(ID,NAME,AGE,TELNUM)
VALUES('1000','SCOTT',20,'01012345567')
오류 보고 -
ORA-00001: unique constraint (SCOTT.SYS_C007093) violated


명령의 108 행에서 시작하는 중 오류 발생 -
INSERT INTO PERSONS(NAME,AGE,TELNUM)
VALUES('SCOTT',20,'010123445567')
오류 보고 -
ORA-01400: cannot insert NULL into ("SCOTT"."PERSONS"."ID")


Table PERSONS2이(가) 생성되었습니다.


Table PERSONS2이(가) 변경되었습니다.


Table PERSONS2이(가) 변경되었습니다.


Table PERSONS2이(가) 변경되었습니다.


Table PLAYS이(가) 삭제되었습니다.


Table PLAYS이(가) 생성되었습니다.


Table PKTABLE이(가) 삭제되었습니다.


Table FKTABLE이(가) 삭제되었습니다.


Table PKTABLE이(가) 생성되었습니다.


Table FKTABLE이(가) 생성되었습니다.


Table FKTABLE이(가) 변경되었습니다.

